#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

// 1. 写两个函数，分别求两个整数的最大公约数和最小公倍数数，用主函数调用这两个函数，并输出结果。两个整数由键盘输入。

// 2. 求方程ax^2+bx+c=0的根，用三个函数分别求当：b^2-4ac大于0、等于0和小于0时的跟并输出结果。从主函数中输入a,b,c的值。

// 3. 写一个判断素数的函数，在主函数输入一个整数，输出是否为素数的信息。

// 4. 写一个函数，使给定的一个3乘3的二维整形数组转置，即行列互换。

// 5. 写一个函数，使输入的一个字符串按反序存放，在主函数中输入和输出字符串。

// 6. 写一个函数，将两个字符串连接。

// 7. 写一个函数，将一个字符串中的元音字母复制到另一个字符串，然后输出。

// 8. 写一个函数，输入一个4位数，要求输出这4个数字字符，但美两个数字间空一个空格。如输入“1990”，应输出“1 9 9 0”。

// 9. 编写一个函数，有实参传来一个字符串，统计次字符串中字母，数字，空格和其他字符的个数，在主函数中输入字符串以及输出上述结果。

// 10. 写一个函数，输入一行字符，将此字符串中最长的单词输出。

// 11. 写一个函数，用“气泡法”对输入的10个字符按有小到大的顺序排列。


// 12. 用牛顿迭代法求根。方程ax^3+bx^2+cx+d=0中a,b,c,d的系数依次为1，2，3，4，由主函数输入。求x在1附近的一个实根。求出根后由主函数输出。

// 13. 用递归方法求n阶勒让德多项式的值（递归公式见书上）。

// 14. 输入10个学生5门课的成绩，分别用函数实现下列功能：
/**    1) 计算每个学生的平均分；
       2) 计算每门课的平均分；
       3) 找出所有50各分数中最高的分数所对应的学生和课程；
       4) 计算平均分方差。
*/

// 15. 写几个函数：
/**    1) 输入10个职工的姓名和职工号；
       2) 按职工号有小到大顺序排序，姓名顺序也随之调整；
       3) 要求输入一个职工号，用折半查找法找出该职工的姓名，从主函数输入要查找的职工号，输出该职工姓名。
*/

// 16. 写一个函数，输入一个十六位进制数，输出相应的十进制数。

// 17. 用递归法讲一个整数n转化成字符串。例如，输入483，应输出字符串“483”。n的位数不确定，可以是任意位数的整数。

// 18. 给出年、月、日，计算该日是第几天。
