#include<stdio.h>
#include <stdlib.h>
#include <string.h>
#include<math.h>

// 3. 从键盘输入一个字符串，将其中的小写字母全部转化成大写字母，然后输入到一个磁盘文件"test"中保存，输入的字符串以"!"结束。

// 4. 有两个磁盘文件“A”和“B”，各存放一行字母，今要求把这两个文件中的信息合并(按字母顺排列)，输出到一个新文件“C”中去。

// 5. 有5个学生，每个学生有3门课程的成绩，从键盘输入学生数据(包括学号，姓名，3门课成绩等)，计算出平均成绩，将原有的数据和计算出的平均分数存放在磁盘文件"stud"中。

// 6. 将第5题“stud”文件中的学生数据，按平均分进行排序处理，将已排序的学生数据存入一个新文件"stud_sort"中。

// 7. 将第6题已排序的学生成绩文件进行插入处理。插入一个学生的3门课程成绩，程序先计算新插入学生的平均成绩，然后将它按成绩高低顺序插入，插入后建立一个新文件。

// 8. 将第7题结果仍存入原有的“stu_sort”文件而不另建立新文件。

// 9. 有一磁盘文件“employee”，内存放职工的数据。每个职工的数据包括职工姓名、职位、性别、年龄、住址、工资、健康状况、文化程度。
//    今要求将职工名、工资的信息单独抽出来新建另一个简明的职工工资文件。

// 10. 从第9题的"职工工资文件"中删去一个职工的数据，再存回原文件。

// 11. 从键盘输入若干行字符串(每行长度不等)，输入后把它们存储到一磁盘文件中。再从该文件中读入这些数据，将其中小写字母转换成大写字母后在显示屏上输出。
