#include<stdio.h>
#include<stdlib.h>
#include<math.h>


// 3. 输入两个正整数m和n，求其最大公约数和最小公倍数。

// 4. 输入一行字符，分别统计出其中的英文字母，空格和其他字符的个数。

// 5. 求Sn=a+aa+aaa+.....+aaaaaa(n个a)的值。其中a是个数字，n表示a的位数。a 和 n 由键盘输入。

// 6. 求1!+2!+3!+.....20!

// 7. 求.....(公式打不出，见课本)

// 8. 输入所有的水仙花数，所谓水鲜花数是指一个三位数，七个位数字立方和等于该数本身。如 153=1+125+27。

// 9. 一个数如果恰好等于它的因子只和，这个数就被成为“完数”。例如 6 的因子是1,2,3，而6=1+2+3，因此6 就是完数。编程找出1000之内所有完数，并按下面格式输出其因子： 6 its fractors are 1,2,3

// 10. 有一个分数序列， 2/1,3/2,5/3,8/5,13/8..... 求出这个数列前20项只和。

// 11. 一个球从100m高度自由下落，每次落地反跳后回到原高度的一半，再下落，再反弹。求它在第10次落地时，共经过多少米，第10次反弹多高。

// 12. 猴子吃桃问题。猴子第1天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了1个。第二天早上将剩下的桃子吃掉一半又多吃了1个。以后每天早上都吃了前一天剩下的一半零1个。
//     到第10天早上想再吃时就只剩1个桃子了。求第一天一共摘了多少个桃子。

// 13. 用迭代法求a的平方根。迭代公式见课本。要求前后两次求出x的差的绝对值小于10的-5次方。

// 14. 用牛顿迭代法求下面方程在1.5附近的根： 2x^3-4x^2+3x-6=0

// 15. 用二分法求下面方程在（-10,10）之间的根： 2x^3-4x^2+3x-6=0

/** 16. 输入以下图案：
                              *
                             ***
                            *****
                           *******
                            *****
                             ***
                              *
*/

// 17. 两个乒乓球进行比赛，各处3人。甲队为A,B,C三人，乙队为X,Y,Z三人。已抽签决定比赛名单。有人向队员打听比赛名单，A说他不和X比，C说他不和X,Z比，请编程找出3对赛手的名单。
