#include <stdio.h>
#include <math.h>
#include <string.h>
#include <stdlib.h>

//本章习题要求用指针方法处理
// 1. 输入3个整数，按由小到大的顺序输出。

// 2. 输入三个字符串，按由小到大的顺序输出。

// 3. 输入10个整数，将其中最小的数与第一个数对换，把最大的数与最后一个数对换。写3个函数：（1）输入10个函数；（2）进行处理；（3）输出10个数。

// 4. 有n个整数，是前面各数顺序向后移m个位置，最后m个数变成最前面m个数，见图8.43。写一个函数实现以上功能，在主函数输入n个整数和输出调整后的n个数。

// 5. 有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下的是原来几号的那位。

// 6. 写一个函数，求一个字符串的长度。在main函数中输入字符串，并输出其长度。

// 7. 有一个字符串，包含n个字符。写一个函数，将此字符串中从第m个字符开始的全部字符复制成另一个字符串。

// 8. 输入一行文字，找出其中大写字母，小写字母，空格，数字以及其他字符各有多少。

// 9. 写一个函数，将一个3乘3的矩阵转置。

// 10. 将一个5乘5的矩阵中最大的元素放在中心，4个角分别放4个最小的元素（顺序为从左到右，从上到下依次从大到小存放），写一个函数实现之。用main函数调用。

// 11. 在主函数中输入10个等长的字符串。用另一个函数对他们排序。然后在主函数输出这10个排好的字符串。
